[
  {
    "title": "What types of materials are used in your travel bags? ",
    "content": "We mostly use sustainable, durable, and high-quality materials in our bags like waxed canvas. These canvas materials are plain woven fabrics, have durability, and are made from biodegradable cotton fibers. The significance of these materials is water-resistance, enduring, and aesthetically pleasing as well.  ",
    "id": "1"
  },
  {
    "title": "What kinds of travel bags do you sell?",
    "content": "A wide variety of travel bags are manufactured by our company with high-quality materials and durability. The bags that our company offers are suitcases, backpacks on wheels, duffel bags, rucksacks, messenger bags, travel totes, and many more.  We will customize your bags at a competitive price. ",
    "id": "2"
  },
  {
    "title": "Does your company provide waterproof travel bags?",
    "content": "All our travel bags are water-resistant which makes you worry-free when traveling in any inclement weather. Our bags help you protect your important documents and other belongings from getting wet from light rain or splashes. For double protection, we offer you separate rain covers for any kind of extreme conditions. ",
    "id": "3"
  },
  {
    "title": "Do you give a warranty on your bag? ",
    "content": "Yes, we provide a manufacturing warranty on all our bags, and every type of manufacturing defect is covered under this warranty support. Depending on the product, our warranty support varies up to five years.",
    "id": "4"
  },
  {
    "title": "Is your bag washable in the washing machine? ",
    "content": "It is suggested by our manufacturing team, not to wash your bag in the washing machine as it could harm the structure or materials of the bag. Just clean our travel bag with a wet cloth and use detergent for cleaning, let it dry. ",
    "id": "5"
  },
  {
    "title": "What makes your travel bag different from other companies?",
    "content": "Each of our bags offers durability, versatility, and exclusive designs that make your travels comfortable and easy. Prioritizing the functionality of our travel bags, we include some thoughtful features and high-quality materials like organized compartments, and ergonomic straps.",
    "id": "6"
  },
  {
    "title": "Where are your bags manufactured? ",
    "content": "We manufacture our bags in the Hong Kong region under the guidance of expert designers. We maintain high quality, exacting standards, and convenience in our bags that maintain expert craftsmanship.",
    "id": "7"
  },
  {
    "title": "Is your travel bag useful during outdoor activities like hiking? ",
    "content": "Yes, we offer a variety of travel bags that perfectly suit your outdoor activity setting. Our specially designed hiking bags or duffel bags are made with rugged materials and other essential features such as a compatible hydration bladder and reinforced straps.",
    "id": "8"
  },
  {
    "title": "What payment method do you expect? ",
    "content": "We only expect cash on delivery method for the convenience of our customers. You can explore our checkout page to analyze our available cash-on-delivery options.   ",
    "id": "9"
  }
]
